import { useState } from 'react';

import BookCard from './BookCard';




function BooksComp(props) {

    const [cUrl, setCUrl] = useState('https://www.e-vrit.co.il/Product/15984/%D7%A7%D7%A8%D7%99%D7%A1%D7%94')
    const [cImgUrl, setCImgUrl] = useState('https://images-evrit.yit.co.il/Images/Products/covers_2019_b/krisa_master.jpg')
    const [mImgUrl, setMImgUrl] = useState('https://www.booknet.co.il/Images/Site/Products/4800037372.jpg')
    const [mUrl, setMUrl] = useState('https://www.booknet.co.il/%D7%9E%D7%95%D7%A6%D7%A8%D7%99%D7%9D/%D7%9C%D7%97%D7%A9%D7%95%D7%91-%D7%9E%D7%A2%D7%A8%D7%9B%D7%AA-4800037372')

    const data = [{
        id: 1,
        btnText: "קריסה",
        imageScr: cImgUrl,
        topHeader: "קריסה",
        hrefLink: cUrl,
        text: "בתו של יגאל נהרגה ברחוב בצפון תל אביב, בתקרית ירי של אנשי העולם התחתון. כיצד נקלעה הדוקטורנטית הצעירה לביוכימיה מאוניברסיטת תל אביב לזירת האירוע? האם הייתה מעורבת בפעילות פלילית? האם היו לה חיים סודיים אפלים? המשטרה, הפרקליטות, התקשורת והממסד הפוליטי כולם מגלים אוזלת יד וחוסר עניין בפתרון התעלומה. יגאל, איש משפחה המנהל חיים צנועים ומומחה לאבטחת מערכות מידע, נעזר בכישוריו המקצועיים ויוצא למסע בחיפוש אחר האמת ולעשיית צדק.בדרכו הוא מגלה שהעולם אותו הכיר כל חייו הוא רק מראית עין המסתירה מאחוריה יקום זר ומעורר אימה, הנעלם מעיני הציבור. הוא מעמיק בחדירתו לתוככי העולם החדש ופורם שכבה אחר שכבה, ובתוך כך מגלה שעליו להימלט על חייו, שכן מעשיו מאיימים להביא לקריסת מוסדות השלטון ולערעור הסדר הקיים. 'קריסה' הוא רומן מתח עכשווי המעורר הרהורים טורדי מנוחה על אודות מנגנונים נסתרים וכוחות זדוניים, השולטים מאחורי הקלעים בישות שנדמית למדינת חוק."
    },
    {
        id: 2,
        btnText: "לחשוב מערכת",
        imageScr: mImgUrl,
        topHeader: "לחשוב מערכת",
        hrefLink: mUrl,
        text:'תורת המערכות היא פרדיגמה שהובילה למהפכה בחשיבה, בין היתר בחשיבה הניהולית. מטרתה היא לשפר את יכולתנו להתמודד עם האתגרים של חיינו ההופכים מורכבים יותר ויותר, זאת באמצעות ראיית העולם כמערכת. הספר לחשוב מערכת הוא בבחינת מסע בעקבות הגישות המערכתיות המרכזיות שהתפתחו החל משנות ה-40 של המאה ה-20 ועד היום.בגישה מעשית, תוך שימוש בדוגמאות מאירות עיניים, נסקרים ומבוארים בספר מושגי מערכת רבים ושונים - בין היתר: הנדסת מגוון, מודלים מנטליים, תאונות נורמליות, בעיות סוררות, שיפוט גבולות, תלות נתיב וערֵמת החול - כל אלה נותנים לנו כלים לחשיבה, להבנה ולפעולה במערכות המסובכות המרכיבות את עולמנו. *אברהם (אבי) אלטמן הוא פסיכולוג ארגוני ששימש יועץ וחוקר בארגונים ציבוריים ועסקיים, במוסדות ללא כוונת רווח וכן בארגוני ממשל רבים. כיום הוא חוקר במרכז דדו לחשיבה צבאית בין־תחומית של צה"ל.'
    }
    ]
    const renderBookCards=(arr=[])=>{
        return arr.map(bookCard => <BookCard btnText={bookCard.btnText} imageScr={bookCard.imageScr} topHeader={bookCard.topHeader}
            hrefLink={bookCard.hrefLink} text={bookCard.text} key={bookCard.id}/>)
    }

    return (
        <div className="booksView">
            {renderBookCards(data)}
        </div>
    )
}
export default BooksComp;


