import { styled } from "@material-ui/core";
import { useState } from "react";
import './About.css';



function AboutComp() {

    const [aviImg, setAviImg] = useState('/avraham.jpg')

    return (
        <div className="about">
            <h2>אודות</h2>
            <div className="imgDiv">
            <img src={aviImg} width={180} height={180}/>
            </div>
            <h3>קו.קוריקולום</h3>
            <p>
                <br/>נולדתי, גדלתי, למדתי, שיחקתי, ניגנתי, טיילתי;
                <br/>התגייסתי, שירתתי, לחמתי, נפצעתי, הוטלאתי, החלמתי;
                <br/> עזבתי, פגשתי, אהבתי, נישאתי, נסעתי, חזרתי;
                <br/> התקבלתי, למדתי, למדתי, למדתי, סיימתי, הוסמכתי;
                <br/> הולדתי, טיפלתי, גידלתי, דאגתי, נישקתי, חיבקתי;
                <br/> עבדתי, בניתי, השתתפתי, ניהלתי, פיתחתי, יסדתי;
                <br/> קראתי, שאלתי, הבנתי, השכלתי, תהיתי, גיליתי;
                <br/> האזנתי, צפיתי, ביקרתי, אהדתי;
                <br/> הלכתי, חזרתי, שמחתי, נעצבתי;
                <br/> פיהקתי, נרדמתי, ישנתי, חלמתי;
                <br/> חשבתי, הרהרתי, הגיתי, נזכרתי;
                <br/> נמלכתי, החלטתי, ישבתי, כתבתי;
            </p>
            <p>
                כך נכתב באתר "סימניה":<br/>
                בן קיבוץ אילון, מתגורר בתל אביב, נשוי, אב לבן ולבת וסבא לשני נכדים.<br/>
                במקצועו הוא פסיכולוג ארגוני, ושימש כיועץ למערכות ציבוריות ועסקיות רבות.
            </p>
        </div>
    )
}

export default AboutComp;

